app/controllers/recommend_controller.rb

  def index
    @sina_statuses = SinaStatus.find(:all, :limit => 10 , :offset => 0)
    @sina_users = SinaUser.find(:all)
---
SELECT * FROM `sina_users` WHERE (`sina_users`.`userID` = '1951130367')

  def testajax
    @tests = SinaUser.all
---
SELECT * FROM `sina_users`